scripts/UC_2_buyItem/result1/Iteration7/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>William345</ns2:safePayUsername><ns2:safePayPassword>0db697a7da9fe60fec61ee2012c0c8c63d03c3b8</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886012345678901</ns2:cardNumber><ns2:expirationDate>062026</ns2:expirationDate><ns2:cvvNumber>456</ns2:cvvNumber><ns2:customerName>William Davis</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>